app/Controllers/Frontend/CourseController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $model = new CourseModel();
        $data =  $model->findAll();

SELECT *
FROM `courses`
WHERE `course_id` = '1'
---
    public function show($id = null)
    {
        $model = new CourseModel();
        $data = $model->getWhere(['course_id' => $id])->getResult();