app/Controllers/CoursesController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $data['courses'] = $this->courses->findAll();

INSERT INTO `courses` (`course`, `category`, `price`, `desc`) VALUES ('abc', '2', 'abc@gmail.com', 'jkgjhgjgh')
---
    public function store(){
        $data = [
            'course' => $this->request->getVar('name'),
            'category' => $this->request->getVar('cat'),
            'price' => $this->request->getVar('price'),
            'desc' => $this->request->getVar('desc'),
            // 'photo' => $this->request->getFile('photo')->getName('photo'),
        ];

        $rules = [
            'name' => 'required|max_length[30]',
            // 'photo' => 'uploaded[photo]|max_size[photo,1024]|ext_in[photo,jpg,jpeg]',
            // 'password' => 'required|max_length[255]|min_length[10]',
            // 'passconf' => 'required|max_length[255]|matches[password]',
            // 'email'    => 'required|max_length[254]|valid_email',
        ];

        if (!$this->validate($rules)){
            return view('courses/insert');
        } else {
            $this->courses->insert($data);

DELETE FROM `courses`
WHERE `id` = '5'
---
    public function delete($id){
        $this->courses->where('course_id', $id);
        $this->courses->delete();

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '7'
---
    public function edit($id){
        $data = $this->courses->find($id);