app/Controllers/ReviewControleller.php

    public function index()
    {
        $data['testimonials'] = $this->reviews->findAll();
---
SELECT *
FROM `testimonials`