app/Controllers/SignupController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('abcd', 'abc@gmail.com', '$2y$10$JVP.PU/p5WDAksYQiOYc9O50rzmv5Jfb6ErBcxfZtnaKD753fQc7.')
---
    public function store()
    {
        $rules = [
            'name'          => 'required|min_length[1]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email',
            'password'      => 'required|min_length[4]|max_length[50]',
            // 'confirmpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $data = [
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                // 'password' => $this->request->getVar('password'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)

            ];

            $userModel = new UserModel();
            $userModel->save($data);